Revit 2027 API
Segment.SizeCount Property
 The number of size objects in the segment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int SizeCount { get; }
Public ReadOnly Property SizeCount As Integer
	Get
public:
property int SizeCount {
	int get ();
}
member SizeCount : int with get
Property Value
Int32
See Also
Reference
Segment Class
Autodesk.Revit.DB Namespace